Австралия/src/InformationRegisters/QuotationKanbanStatuses/QuotationKanbanStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>QuotationKanbanStatuses</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Status</name>
    <type>
      <types>CatalogRef.QuotationStatuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Quotation</name>
    <type>
      <types>DocumentRef.Quote</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Catalogs/QuotationStatuses/QuotationStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>QuotationStatuses</name>
  <predefined>
    <items>
      <name>Closed</name>
      <description>Closed</description>
    </items>
    <items>
      <name>Converted</name>
      <description>Converted</description>
    </items>
  </predefined>
  <attributes>
    <name>HighlightColor</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Order</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Disabled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/CommonModules/QuotationStatuses/Module.bsl
#Region Public

Function CheckQuotationStatusToConverted(QuotationRef) Export
	
	Result = False;
	
	If ValueIsFilled(QuotationRef) And TypeOf(QuotationRef) = Type("DocumentRef.Quote") Then
		
		QuoteStatus = GetQuotationStatus(QuotationRef);
		If QuoteStatus <> Catalogs.QuotationStatuses.Closed And QuoteStatus <> Catalogs.QuotationStatuses.Converted Then
			Result = True;
		EndIf;
		
	EndIf;
	
	Return Result;
	
EndFunction

Function GetQuotationDefaultStatus() Export
	
	Result = Catalogs.QuotationStatuses.EmptyRef();
	
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	QuotationStatuses.Ref AS Status
	|FROM
	|	Catalog.QuotationStatuses AS QuotationStatuses
	|WHERE
	|	NOT QuotationStatuses.Disabled
	|	AND NOT QuotationStatuses.DeletionMark
	|
	|ORDER BY
	|	QuotationStatuses.Order";
	
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Result = Selection.Status;
	EndIf;
	
	Return Result;
	
EndFunction

Function GetQuotationStatus(QuotationRef) Export
	
	Result = Catalogs.QuotationStatuses.EmptyRef();
	
	If ValueIsFilled(QuotationRef) And TypeOf(QuotationRef) = Type("DocumentRef.Quote") Then
		
		Query = New Query;
		Query.SetParameter("QuotationRef", QuotationRef);
		Query.Text = 
		"SELECT
		|	QuotationKanbanStatuses.Status AS Status
		|FROM
		|	InformationRegister.QuotationKanbanStatuses.SliceLast(, Quotation = &QuotationRef) AS QuotationKanbanStatuses";
		
		Selection = Query.Execute().Select();
		If Selection.Next() Then
			Result = Selection.Status;
		EndIf;
		
	EndIf;
	
	Return Result;
	
EndFunction

Procedure SetQuotationStatus(QuotationRef, NewStatus) Export
	
	If ValueIsFilled(QuotationRef)
		And TypeOf(QuotationRef) = Type("DocumentRef.Quote")
		And ValueIsFilled(NewStatus)
		And TypeOf(NewStatus) = Type("CatalogRef.QuotationStatuses") Then
		
		Status = GetQuotationStatus(QuotationRef);
		If Not ValueIsFilled(Status) Or Status <> NewStatus Then
			
			RecordManager = InformationRegisters.QuotationKanbanStatuses.CreateRecordManager();
			RecordManager.Quotation = QuotationRef;
			RecordManager.Status = NewStatus;
			RecordManager.Period = CurrentSessionDate();
			RecordManager.Write();
			
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion
